docs: diagrams
